import React from 'react'
import './Blogs.css'
const Blogs = () => {
    return (
        <div>
            <div>
                <h1>কন্টেক্সট এপিআই কি জিনিস? </h1>
                <h4>রিয়েক্ট এ আমরা মূলত একটা component  থেকে আরেকটা কম্পোনেন্টের ডাটা সেন্ড করি props এর মাধ্যমে। তবে অনেক সময় এমন হয়ে যায় যে আমাদের মেইন কম্পনেন্ট যেখানে আমাদের ডাটা রয়েছে সেখান থেকে চাইল্ড কম্পনেন্ট অর্থাৎ যেখানে আমি ডাটা পাঠাতে চাই সেটা অনেক নিচে রয়েছে। এক্ষেত্রে আমাদের মেইন কম্পনেন্ট থেকে ডাটা পাঠাতে হলে এর নিচের চাইল্ড কম্পোনেন্ট  যত লেভেল নীচে থাকবে তত লেভেল পর্যন্ত props আকারে পাঠাতে হয় এটাকে প্রপস ড্রিলিং বলে।এই বিরক্তিকর props drilling এর কাজটা খুব সহজেই context api এর  মাধ্যমে করে ফেলা যায়।  প্রপস পাঠানো ছাড়াই context api এর মাধ্যমে স্টেটে ডাটা রেখে সকল চাইল্ড এর মাধ্যমে ডাটা শেয়ার করা যায়। </h4>
            </div>
            <div>
                <h1>
                    সিমান্টিক ট্যাগ কাকে বলে?
                </h1>
                <h4>
                    সিমান্টিক ট্যাগ ব্যবহার করার ফলে ব্রাউজার খুব সহজে বুঝতে পারে যে ওই tag টা html  এর একটি নির্দিষ্ট উদ্দেশ্যে ব্যবহার করা হয়েছে।যেমন nav ট্যাগ, আমরা যদি nav ট্যাগ ইউজ করি তাহলে ব্রাউজার খুব সহজেই বুঝে ফেলবে যে nav ট্যাগ এর ভিতরে যে elements গুলো আছে সেটা নেভিগেশনের জন্য ইউজ করা হয়েছে।অর্থাৎ সিমান্টিক ট্যাগ হল ওই tags  যেগুলোর নাম শোনা মাত্রই খুব সহজে বুঝা যায় যে ওই ট্যাগ এর কাজ কী?
                    যেমন header, footer, aside, nav, etc
                </h4>
            </div>
        </div>
    )
}

export default Blogs